eac-core/eac/eacWebServiceApp/src/test/resources/soap/v2/redeemActivationCodesRequest4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eac="http://eac.oup.com/2.0/eac-access-services"
xmlns:cmn="http://eac.oup.com/2.0/eac-common-types">
   <soapenv:Header/>
   <soapenv:Body>
      <eac:RedeemActivationCodeRequest >
         <cmn:wsUserId>
         	<cmn:userName>runtimeException</cmn:userName><!-- this simulates a runtimeexception being thrown -->
         </cmn:wsUserId>
         <eac:activationCode>AC1</eac:activationCode>
         <eac:locale  /><!-- locale is missing language -->
      </eac:RedeemActivationCodeRequest>
   </soapenv:Body>
</soapenv:Envelope>
